partially updated README
